{
  "file_id": "cef6cfec-11ce-44bc-ad27-9b592f88f332",
  "vector_id": "transcription_cef6cfec-11ce-44bc-ad27-9b592f88f332",
  "transcription": " you I'm going to go to the next floor. Yeah, there you go. Yeah, there you go. Okay. Hello. Hello, you know what we're doing. I'm very well. How are you? I'm doing good. Thanks for asking. Let me check is a mall on the corner. Okay. I think we can start and if they're able to join that that should work for. We can start. Okay. Thank you. Thank you so much for running this particular call. And actually we saw that you came to the company space. So I dropped a note where you put an inquiry and you were going to a couple of. We think that projects. Right. Yes. Perfect. So we were actually looking forward to get the insights on those part. And before I start these particular call, let me like give you a brief introduction about who we are. And who are there on the call? Yeah. Thank you. Myself, Devanshi. I've been working with Third of techno as a customer success manager. And along with me, I'm having tap on who is leading the sales at the marketing department with Third of techno. And we have been working with the company. We have been specialized in building the videos like scalable, Vaman mobile applications across the fintech and the cross-border solutions. We have been leveraging AI in a couple of our projects also. So that's where we've been working. We have been also. So that's where we actually been working around. So as a next step, what we wanted to understand from you. I wanted to share that you're looking for something related to the social challenges. So I would like to get some understanding from your end. And then we can jump into the following discussion. Okay. Thank you so much. Devanshi. So social remit is a money transfer for lack of a network is a money transfer cost. Our customers are based in the UK. And they're with our load in our app sending the money to the other parts of the world. We would also have the multi currency account functionality where customers can open an account in another currency and be able to use that account to transfer money to loved ones. So that is what we're currently working on. In terms of. In terms of other products, we have other products that we would want to be added onto the platform, but we currently not ready with that yet. And for what we are looking for, we are currently looking for a company that would help us to do two things. One is to build our prototype. At the moment, we are funding the company ourselves. We want to go out and speak to investors, but we need a prototype that is clickable that we can use to explain to investors. What we what our products are and how it can be used. We are also looking for someone to develop the front end of the app for us and also the web. So that we can be either we would use a third party to integrate with the front end. We can use it or if you also develop the back end that would be a great advantage. So that we can have all three at one place. If we can't have all three, but we can have different fragments, then it's something you can explain to us and then we can discuss. So this is what we are currently in for. Thank you for sharing this particular inside. So what I understood from this thing that there would be you are looking for a team who can assist you with building a prototype. For like for money transfers out of thing. That you're looking around and further you're also looking for the front end development in that particular part. So as I understood that this is just an idea. So do you have anything in your mind or something that scope around that you are looking forward to or you also need the help in the design. In terms we we don't have a thing my design back we have the design written out and as to the process how we want it to work. Myself and other co founders we are coming from the remitter space. I have been in the remitter space for the past 20 years. So we kind of know what we are looking for. We know what how the best should look like. So we have that written down which can help you in terms of designing the user experience. We do have that and of course we also have. Like it says and people who are already in the field that we can also give you. Lens you so that you would help you. Know what we are looking for exactly. Yes definitely it will be helpful to us also and in fact we will be getting some idea regarding whether it would be the interlinking into the wallets or. Are you looking to send it to the external bank accounts impact will be able to get that flow over here. Sure I can send that to you. Sure in fact I would like to add away as I'm yes. Hi Penny for you. Thank you for joining the call and thank you for explaining the product that you are looking to build and. I think lately many new products and companies are coming up into this space because traditional limit is via banks have been a bit clumsy and painstakingly hard for individuals to go through. So that says a lot about the space which is evolving a lot. Can you help me understand one crucial aspect here because we are talking about cross border and we tell us how who are going to be our providers for the service like. Are we building the entire backbone that will connect us with systems and the banking systems or we are going to use some. Other third parties tool and we are going to build a front end layer to use their services and create this specialization. Okay thank you so. This project we have it into folks when we started off we were looking for a system that has already been built and we will develop our front end and the mobile and so that we will do an integration through that back end which already have the KYC. So that is how we set out for along the line we thought that if we can have the alternative of having the front end and the back end ourselves that could also potentially help us with how we want to grow and now we want to scale up. So it would depend on your specialty and what you can do to help us whichever way we will be happy to have a discussion's fed to see how we can work together. Okay thanks for that information and so it's clear to me on two points both your visions. Let me share some of my experience in the previous projects that we have worked with and the way we have done is because when I say back end and front end when you say back it of course in the business logic and front end being something that is. Exposed to the front user to use our services now as a company we have the capabilities to build the front end that is the user experience design it implemented and we do also have the capability to create a back end business logic. But the catch and a caveat over here is we being a technology company we don't have necessarily license either systems that needs to be integrated with the banking systems or remittance systems right. In we can create our own back end that can integrate with that that back end we can create that we cannot create our own remittance systems like the Swift networks or pure ears or stripe they have their own diets with bands other bodies and necessary government regulatory licenses to do those kind of transfers so. If we are to work on this project we would have to tie up with some bulk service provider who offers this kind of services who service we use to create those transactions now the backend to call those services create the transitions and everything that we can do but the core of that system needs to be taken from some providers because that's a big thing that's an entire large. So we have a lot of different services available in itself and we do not have an detailed experience on that building those compliances tying up with the agencies who open up their systems to us and then we create that entire system. So that's what we have done and what we can do I hope that gives us a sense of where we are at. Thank you to pan and I think I agree with you in terms of the complete is what you can do from the backend and you are so right so in terms of the integration with third parties we have already spoken to banks to payments providers to cut acquires and merchants to KYC and the protocols. So we have done all that work so if we have the backend then these companies would integrate into it because obviously you need licenses to be able to do these services so they would integrate these services in a backend so that we can we can be able to to use it so you are so right in. And what you said what we are looking for is the dashboard or console where we can manage the customer the customer will not see that but we can manage the customer but in terms of the tools and solutions to use we would work with third parties and integrate into that platform to be able to do that does it make sense to you. Yes, it totally does make sense and I think that's exactly in our ballpark of the skills that we have so we can we have skill set and the ability to create a system where the front end you have for you to own what your customers and there is a customer front end that they can use to. Check their own details and make their transactions and we have the ability to create a backend that will eventually integrate with this player the card issuers the bankers and the other agencies that comes into the picture so that's a right place for us to be in so we can create that system in fact a small use case that we did a couple of years I think it was around the pandemic time where we worked with payment agency. Payment agency payment company something like this, which is called zapper they are based out of the United, the UK London and we work with their Spanish branch to create a digital wallet systems where we created this what we say the dashboard where the admin were able to own what the users and create their accounts and everything and there are end users were having their own mobile application to use. The zapper systems and this was a little bit different this was not in the same domain as the emitters but it was in a domain where there were physical there were actual financial transactions happening and we had integrated with the card issuers and all that into that system zapper yeah that's correct. We work for their screen division I think currently they have wrapped when we worked they were there in spin last I checked they had. wrapped up their screen division and I still think they are active in the UK. So yes so that's there for me. I see as a logical next step over here is to understand and have a look at the research that you have done I suppose that is what you mentioned at the start a document that you're prepared and that's when we can have our once we do that we can have a next call to understand the functionality and start building a product documentation to at least have something what we call as. TRD a project product requirement document and a business requirement document in which are somewhat similar and that could become our foundation stone to design and build this entire system that you are looking towards. Fantastic so what I would do is that I would send. And the end of the year to you and that will be signed and once we complete it I will send you the step by step guide for the money transfer and for the multi currency account so that you can review it and then next week we can have a meeting to see. So in terms of the time like how long it can take you what are the stages can we have the front end and and the web maybe in the next four weeks so that we can have the actual system which would take a while like I presume so that we with the front end we can just plug into. And a software and that has already been built for us to use for at least a year whilst you take your time to build what we actually want at the end of the day that is also something we can discuss I think the other bit is also the prototype so we are looking for you to design the prototype which would be clickable. And which we can share with our investors as to what the vision terms of the pictorial of what the vision is so these are the things that we we require so we would send the end and we of course send the functionalities and that require and you can come back to us and give us timelines and course and we can take you from there is that okay. Yes that's absolutely time for us it's a first step in our general process also to start with an on disclosure agreement. And then we'll go through the document that you share understand it and I'm sure me and my team would have a lot of questions around that we'll try we'll do our own set of research and understanding of the domain much deeper and around the questions that we have. And the ones that are not answered I think we'll send it over an email if possible or over a short 30 minutes meeting to clarify those and post we have that details and we would be surely able to define few things for you that is what kind of technology security use how would we approach this like what would we be building in what would be our faces like starting with a front end then we'll do middleware and then the final product will come with that also. And then with that we will be able to give you tentative timelines and a possible budget in a range that would be required to build the first prototype and then the first word you know the product and then the entire product so that is something you could expect from us eventually. Between the state of today and the final say that might happen one or two quick meetings to just solidify our understanding and clarify any doubts that we have so whatever we deliver at the end is something that what you are looking for in terms of even documents or the cost and the pricing also. Yeah that works so you can you can send your documents as well send hours hopefully if that's done today we can send you the customer Jenny what we have and then you take it from there. What should you require from us to send us the end here like what kind of details. Just an email address and send that to you. Perfect I hope they aren't you we have pennies emails to send over our email address and the company details what is required let's do that. Sorry I forgot to ask my manners depending you are based out of the UK or which part of the world. Yes so we are based in the UK. Amazing and I think there is someone else from your team who has joined a little late would you like to introduce them. Yes so that is a male a male expert of the class development team working on this project. Thank you nice to meet you. Nice to meet you, channel. Penny was able to answer all the questions for today or would you like to ask anymore I wouldn't be happy to share any details or to my expertise possible. I think I think it's clear I'm confident based on the questions and everything you are accent that this will be a right partnership. And so let's crack on it and get the necessary documentation signed and then we send you the user Jenny you have a look review it of course we have been in the remittance business for quite a time now. But you are also a developer you would know what would work best and what would not so we are open to suggestions as well we are open to recommendations based on what we provide and once we all agree we can then be able to work on the project. That sounds really good and I think this could be a nice partnership to work upon because the many it's not that frequent that we work get to work with people who actually are in the industry for so long and they bring in the domain knowledge because as a technology company you always bring the tech to the table we know how the tech should work how it works into the that particular domain but actual practical knowledge of that particular domain really helps to build a nice product. So I look forward to working on this once we have I love the details so I sure will share those details and we wait for the NBA and let's connect soon. Okay, thank you so much. Thank you another good day. Thank you, thank you for joining how wonderful day I take care. Thank you. Thank you.",
  "metadata": {
    "duration": 1462.741,
    "language": "en",
    "file_type": "wav",
    "speakers": 1,
    "created_at": "2025-06-12T23:29:10.001916"
  }
}